In [1]:
import numpy as pd
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv(r'C:\Users\user\Downloads\StudentsPerformance.csv')
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

# 1. How many males and females participated in test?

In [4]:
avearage=(data['math score']+data['reading score']+data['writing score'])/3
avearage#To check whether all the three scores are not zero for all the entries

0        9.000000
1       18.333333
2       26.000000
3       27.000000
4       31.333333
          ...
995     89.000000
996     94.000000
997     98.666667
998     97.666667
999    100.000000
Length: 1000, dtype: float64

In [5]:
avearage.isna().sum()#to check for the missing values

0

In [6]:
male_count=len(data[data['gender']=='male'])
female_count=len(data[data['gender']=='female'])
male_count

482

In [7]:
female_count

518

# 2.What  do you think about the students parental level of Education?

In [8]:
print(data['parental level of education'])

0        some high school
1             high school
2        some high school
3            some college
4            some college
              ...
995          some college
996          some college
997          some college
998    associate's degree
999     bachelor's degree
Name: parental level of education, Length: 1000, dtype: object

In [9]:
data.loc[data['parental level of education']=='some high school','parental level of education']='high school'
data.head()#the column with some high school is replaced with high school as both are same

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [10]:
data['parental level of education'].mode()# finding the mode

0    high school
Name: parental level of education, dtype: object

In [11]:
#Majority of students parental level of education is high school

# 3.Who scores the most on average for math,reading and writing based on 
#  a.gender

In [11]:
data_female=data[(data.gender=='female')]#dataset for females
data_female

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
513,female,group E,bachelor's degree,standard,completed,99,100,100
514,female,group E,high school,standard,none,99,93,90
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100

In [13]:
data_female.mean()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\1412039934.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_female.mean()

math score       63.376448
reading score    72.590734
writing score    72.467181
dtype: float64

In [14]:
data_male=data[(data.gender=='male')]#dataset for males
data_male

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
518,male,group C,high school,free/reduced,none,27,34,36
519,male,group A,some college,free/reduced,none,28,23,19
520,male,group B,high school,free/reduced,none,30,24,15
521,male,group E,high school,standard,none,30,26,22
522,male,group B,some college,free/reduced,none,31,32,34
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [15]:
data_male.mean()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\2510148598.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_male.mean()

math score       68.821577
reading score    65.545643
writing score    63.446058
dtype: float64

In [16]:
if data_female['math score'].mean()>data_male['math score'].mean():
    print('Average math score is more for females')
else:
    print('Average math score is more for males')

Average math score is more for males

In [17]:
if data_female['reading score'].mean()>data_male['reading score'].mean():
    print('Average reading score is more for females')
else:
    print('Average reading score is more for males')

Average reading score is more for females

In [18]:
if data_female['writing score'].mean()>data_male['writing score'].mean():
    print('Average writing  score is more for females')
else:
    print('Average writing  score is more for males')

Average writing  score is more for females

# b.Test preparation course

In [19]:
data['test preparation course']

0           none
1           none
2           none
3           none
4           none
         ...
995    completed
996    completed
997    completed
998    completed
999    completed
Name: test preparation course, Length: 1000, dtype: object

In [20]:
data_coursecomplete= data[data['test preparation course']=='completed'] #dataset for those who completed the preparation course
data_coursecomplete

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
5,female,group B,high school,free/reduced,completed,23,44,36
10,female,group C,high school,free/reduced,completed,29,40,44
12,female,group B,high school,standard,completed,32,51,44
16,female,group A,high school,free/reduced,completed,34,48,41
21,female,group D,high school,free/reduced,completed,35,55,60
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [21]:
data_courseincomplete= data[data['test preparation course']=='none']
data_courseincomplete

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
984,male,group E,high school,standard,none,94,88,78
986,male,group E,high school,standard,none,94,73,71
987,male,group D,master's degree,standard,none,95,81,84
990,male,group C,associate's degree,standard,none,97,93,91
991,male,group E,some college,standard,none,97,87,82

In [22]:
data_coursecomplete.mean()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\3957160745.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_coursecomplete.mean()

math score       69.966480
reading score    74.175978
writing score    74.684358
dtype: float64

In [23]:
data_courseincomplete.mean()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\4057663470.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_courseincomplete.mean()

math score       63.789720
reading score    66.417445
writing score    64.457944
dtype: float64

In [24]:
if data_coursecomplete['math score'].mean()>data_courseincomplete['math score'].mean():
    print('Average math score is more for course attended students')
else:
    print('mathscore has no effect on coure attended status')

Average math score is more for course attended students

In [25]:
if data_coursecomplete['reading score'].mean()>data_courseincomplete['reading score'].mean():
    print('Average reading score is more for course attended students')
else:
    print('reading score has no effect on coure attended status')

Average reading score is more for course attended students

In [26]:
if data_coursecomplete['writing score'].mean()>data_courseincomplete['writing score'].mean():
    print('Average writing score is more for course attended students')
else:
    print('writing score has no effect on coure attended status')

Average writing score is more for course attended students

# 4.What do you think about the scoring variation for math,reading and writing based on a)Gender

In [29]:
data_female.std()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\1064707667.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_female.std()

math score       16.029928
reading score    14.411018
writing score    14.844842
dtype: float64

In [30]:
data_male.std()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\2676272684.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_male.std()

math score       14.556411
reading score    14.149594
writing score    14.227225
dtype: float64

In [ ]:
#the standard deviation of mathscore in females is higher

# b)Test preparation course

In [31]:
data_coursecomplete.std()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\3278814400.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_coursecomplete.std()

math score       14.521847
reading score    13.537572
writing score    13.236412
dtype: float64

In [32]:
data_courseincomplete.std()

C:\Users\user\AppData\Local\Temp\ipykernel_6380\2597170158.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_courseincomplete.std()

math score       15.705689
reading score    14.608896
writing score    15.041667
dtype: float64

# 5.The management needs your help to give bonus points to the top 25% of students based on their math score,so how will you help the management to achieve this.

In [33]:
data1=data.sort_values(by='math score',ascending=False)
data1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
2,female,group B,high school,free/reduced,none,18,32,28
51,female,group C,high school,free/reduced,none,13,41,51
3,female,group B,some college,standard,none,11,38,32
1,female,group B,high school,free/reduced,none,8,24,23
0,female,group C,high school,free/reduced,none,0,17,10

In [34]:
data1['math score'].quantile(0.75)

77.0

In [35]:
top_25data=data1[data1['math score']>=77]
top_25data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
851,male,group D,some college,standard,completed,77,62,62
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
421,female,group C,some college,free/reduced,none,77,90,91
414,female,group A,high school,free/reduced,completed,77,88,85